#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "");
	// Задание 1
	int a1, b1, c1, d1;
	d1 = 7;
	a1 = 11;

	for (;;) {
		if (a1 == 11) {

			cout << "Выберите фигуру\n";

			cout << "1\t\t2\t\t3\t\t4\t\t5\n";
			cout << ".........\t.........\t.........\t.........\t.........\n";
			cout << ".*******.\t.*      .\t.*******.\t.       .\t.*******.\n";
			cout << ". ******.\t.**     .\t. ***** .\t.       .\t. ***** .\n";
			cout << ".  *****.\t.***    .\t.  ***  .\t.       .\t.  ***  .\n";
			cout << ".   ****.\t.****   .\t.   *   .\t.   *   .\t.   *   .\n";
			cout << ".    ***.\t.*****  .\t.       .\t.  ***  .\t.  ***  .\n";
			cout << ".     **.\t.****** .\t.       .\t. ***** .\t. ***** .\n";
			cout << ".      *.\t.*******.\t.       .\t.*******.\t.*******.\n";
			cout << ".........\t.........\t.........\t.........\t.........\n";
			cout << "6\t\t7\t\t8\t\t9\t\t10\n";
			cout << ".........\t.........\t.........\t.........\t.........\n";
			cout << ".*     *.\t.*      .\t.      *.\t.*******.\t.      *.\n";
			cout << ".**   **.\t.**     .\t.     **.\t.****** .\t.     **.\n";
			cout << ".*** ***.\t.***    .\t.    ***.\t.*****  .\t.    ***.\n";
			cout << ".*******.\t.****   .\t.   ****.\t.****   .\t.   ****.\n";
			cout << ".*** ***.\t.***    .\t.    ***.\t.***    .\t.  *****.\n";
			cout << ".**   **.\t.**     .\t.     **.\t.**     .\t. ******.\n";
			cout << ".*     *.\t.*      .\t.      *.\t.*      .\t.*******.\n";
			cout << ".........\t.........\t.........\t.........\t.........\n";
			cout << "\nВыход с программы - 0\n";
			cout << "\nМеню - 11\n\n";

		}
		else if (a1 == 0)break;

		cout << "Введите номер фигуры\n";
		cin >> a1;



		for (b1 = 0; b1 < d1; b1++)
		{
			for (c1 = 0; c1 < d1; c1++)
			{
				if (a1 == 1 && b1 <= c1)
					cout << "*";
				else if (a1 == 2 && b1 >= c1)
					cout << "*";
				else if (a1 == 3 && b1 <= c1 && b1 + c1 <= d1 - 1)
					cout << "*";
				else if (a1 == 4 && b1 >= c1 && b1 + c1 >= d1 - 1)
					cout << "*";
				else if (a1 == 5 && b1 <= c1 && b1 + c1 <= d1 - 1 or a1 == 5 && b1 >= c1 && b1 + c1 >= d1 - 1)
					cout << "*";
				else if (a1 == 6 && b1 >= c1 && b1 + c1 <= d1 - 1 or a1 == 6 && b1 <= c1 && b1 + c1 >= d1 - 1)
					cout << "*";
				else if (a1 == 7 && b1 >= c1 && b1 + c1 <= d1 - 1)
					cout << "*";
				else if (a1 == 8 && b1 <= c1 && b1 + c1 >= d1 - 1)
					cout << "*";
				else if (a1 == 9 && b1 + c1 <= d1 - 1)
					cout << "*";
				else if (a1 == 10 && b1 + c1 >= d1 - 1)
					cout << "*";
				else
					cout << " ";
			}
			cout << endl;
		}
	}

	cout << "Задание 2: Подсчитать количество целых чисел в диапазоне от 100 до 999 у которых есть две одинаковые цифры\n";
	int a2, b2, c2, d2;
	d2 = 0;
	for (a2 = 1; a2 < 10; a2++)
		for (b2 = 0; b2 < 10; b2++)
			for (c2 = 0; c2 < 10; c2++)
				if (a2 == c2 or b2 == c2 or a2 == b2) d2++;
	cout << endl << d2 << " числа" << endl << endl;

	cout << "Задание 3: Подсчитать количество целых чисел в диапазоне от 100 до 999 у которых все цифры разные\n";
	int a3, b3, c3, d3;
	d3 = 0;
	for (a3 = 1; a3 < 10; a3++)
		for (b3 = 0; b3 < 10; b3++)
			for (c3 = 0; c3 < 10; c3++)
				if (a3 != c3 && b3 != c3 && a3 != b3) d3++;
	cout << endl << d3 << " чисел" << endl << endl;

	cout << "Задание 4: Пользователь вводит любое целое число. Необходимо из этого целого числа удалить все цифры 3 и 6 и вывести обратно на экран.\n";

	int a4 = 0, b4;
	for (;;) {
		cout << "Выход с программы - 0";
		cout << endl;
		cout << "Введите число ";
		cin >> b4;
		if (b4 == 0)break;
		for (; b4 > 0;)
		{
			if (b4 % 10 != 3 &&
				b4 % 10 != 6)
			{
				a4 *= 10;
				a4 += b4 % 10;
			}
			b4 /= 10;

		}
		cout << "Ваше число ";
		for (; a4 > 0;)
		{
			cout << a4 % 10;
			a4 /= 10;
		}
		cout << endl;

	}

	cout << "Задание 5: Пользователь вводит любое целое число А. Необходимо вывести все целые числа В,";
	cout << "для которых А делиться без остатка на В * В и не делиться без остатка на В * В * В";
	cout << endl;

	int a5, b5;
	b5 = 1;
	for (;;) {
		cout << "Выход с программы - 0";
		cout << endl;
		cout << "Введите число ";
		cin >> a5;
		if (a5 == 0)break;
		for (; b5 < a5; b5++) {
			if (a5 % (b5 * b5) == 0 && a5 % (b5 * b5 * b5) != 0) cout << b5 << " ";
		}
		cout << endl;
	}

	cout << "Задание 6: Пользователь вводит целое число А.Программа должна определить, что куб суммы";
	cout << "цифр этого числа равен А* А";
	cout << endl;

	int a6, b6;
	for (;;) {
		b6 = 0;
		cout << "Выход с программы - 0";
		cout << endl;
		cout << "Введите число ";
		cin >> a6;
		if (a6 == 0)break;
		for (; a6 > 0;)
		{
			b6 += a6 % 10;
			a6 /= 10;

		}
		if (b6 * b6 * b6 == a6 * a6)
			cout << endl << "Равен" << endl;
		else
			cout << endl << "Неравен" << endl;
	}


	cout << "Задание 7: Пользователь вводит целое число.Необходимо вывести все целые числа, на которое";
	cout << "заданное число делиться без остатка.";
	cout << endl;
	int a7, b7;
	for (;;) {
		b7 = 1;
		cout << "Выход с программы - 0";
		cout << endl;
		cout << "Введите число ";
		cin >> a7;
		if (a7 == 0)break;
		for (; b7 <= a7; b7++)
		{
			if (a7 % b7 == 0)cout << b7 << " ";

		}
		cout << endl;

	}


	cout << "Задание 8: Пользователь вводит два целых числа.Необходимо вывести все целые числа, на";
	cout << "которые оба введенных числа делятся без остатка.";
	cout << endl;
	int a8, b8, c8;
	for (;;) {
		b8 = 1;
		cout << "Выход с программы - 0";
		cout << endl;
		cout << "Введите число a ";
		cin >> a8;
		if (a8 == 0)break;
		cout << "Введите число b ";
		cin >> c8;
		for (; b8 <= (a8 + c8); b8++)
		{
			if (a8 % b8 == 0 && 87 % 87 == 0)cout << b8 << " ";

		}
		cout << endl;

	}

	cout << "Задание 9:Пользователь вводит число.Определить количество цифр в этом числе, посчитать их сумму и";
	cout << "среднее арифметическое.Определить количество нулей в этом числе.Общение с пользователем";
	cout << "организовать через меню.";
	cout << endl;
	int a9, e9;
	double  b9, c9, d9;
	for (;;) {
		b9 = 0;
		c9 = 0;
		d9 = 0;
		cout << "Цифр в числе - 1" << endl;
		cout << "Сумма цифр в числе - 2" << endl;
		cout << "Среднее арифметическое цифр - 3" << endl;
		cout << "Нулей в числе - 4" << endl;
		cout << "Все действия - 5" << endl;
		cout << "Выход с программы - 0" << endl;
		cout << "Выберите действие: " << endl;
		cin >> e9;
		if (e9 == 0)break;
		cout << endl;
		cout << "Введите число ";
		cin >> a9;

		for (; a9 > 0; c9++)
		{
			if (a9 % 10 == 0) {
				d9++;
			}
			b9 += a9 % 10;
			a9 /= 10;

		}

		switch (e9) {
		case 1:
			cout << "Цифр в числе " << c9 << endl;
			break;
		case 2:
			cout << "Сумма цифр в числе " << b9 << endl;
			break;
		case 3:
			cout << "Среднее арифметическое цифр " << b9 / c9 << endl;
			break;
		case 4:
			cout << "Нулей в числе " << d9 << endl << endl;
			break;
		case 5:
			cout << "Цифр в числе " << c9 << endl;
			cout << "Сумма цифр в числе " << b9 << endl;
			cout << "Среднее арифметическое цифр " << b9 / c9 << endl;
			cout << "Нулей в числе " << d9 << endl << endl;
			break;

		}

	}


	cout << "Задание 10: Написать программу, которая выводит на экран шахматную доску с заданным размеромклеточки.";

	int a10 = 0, b10, d10, e10;
	cout << "Введите размер клеточки ";
	cin >> e10;
	for (; a10 < 6; a10++) {
		b10 = 0;
		for (; b10 < 8; b10++) {
			d10 = 0;
			for (; d10 < e10; d10++) {
				if (b10 % 2 == 1 && a10 < 3) {
					cout << "-";
				}
				else if (b10 % 2 != 1 && a10 >= 3) {
					cout << "-";
				}
				else cout << "*";
			}
		}
		cout << endl;
	}
}